Repository: AJARProject/AJ_Tools_Regex
Catalog: AJ_Tools_RegexLab/Resources/*.lproj/Lab interface.xlf
Languages: french

source: Test name
french: Nom

source: Pattern
french: Motif

# Target
source: Target text
french: Texte cible

source: Result
french: Résultat

# Replacement
source: Replacement text
french: Texte de remplacement

# Extract
source: Extract groups
french: Groupes à extraire

source: Details
french: Détails

# GroupSplit
source: Capture Group split display
french: Afficher chaque groupe de capture

# New test
source: New
french: Nouveau

# Save test
source: Save
french: Enregistrer

# Duplicate test
source: Duplicate
french: Dupliquer

# Delete test
source: Delete
french: Supprimer

source: Export...
french: Exporter...

source: Import...
french: Importer...

source: Test
french: Tester

# WS_Push
source: Publish...
french: Publier...

# WS_Get
source: Get...
french: Lire...

source: Length
french: Longueur

source: String
french: Chaîne

source: Group
french: Groupe

# Group list
source: Use a comma to separate each group (Eg : 2, 3)
french: Utilisez une virgule comme séparateur (Ex. : 2, 3)

# Clipboardtip
source: Shift+Clic -> copy only the expression
french: Shift+Clic -> copie uniquement l'expression

source: True
french: Vrai

source: False
french: Faux

source: Matching
french: Trouver

source: Substitution
french: Substituer

source: Splitting
french: Découper

source: Extracting
french: Extraire

# thank_you
source: Thank you for your contribution!
french: Merci pour votre contribution !

# ID_number
source: The ID number is :
french: Le numéro d'ID est :

# ask_email
source: Your e-mail address :
french: Veuillez indiquer votre adresse e-mail :

# ask_name
source: Please indicate your name, first name and/or another mentions that you want to publish :
french: Veuillez indiquer votre nom, prénom et/ou autre mentions que vous désirez voir mentionné :

source: Validate
french: Valider

source: Cancel
french: Annuler

# Choose_typeOfRule
source: Choose in which group of rules you want to apply the current pattern:
french: Choisissez dans quel groupe de règles vous souhaitez appliquer le motif courant :

source: Copy
french: Copie

# Launch
source: Launch the Regex Lab
french: Lancer le laboratoire de test

# CommonMenuItemUndo
source: Undo
french: Annuler Edition

# CommonMenuItemCut
source: Cut
french: Couper

# CommonMenuItemCopy
source: Copy
french: Copier

# CommonMenuItemPaste
source: Paste
french: Coller

# CommonMenuItemClear
source: Clear
french: Effacer

# CommonMenuItemSelectAll
source: Select All
french: Tout Selectionner

# CommonMenuItemShowClipboard
source: Show Clipboard
french: Afficher le Presse-papiers

# CommonMenuItemDesign
source: Design
french: Développement

# CommonMenuItemQuit
source: Quit
french: Quitter

# CommonMenuItemClose
source: Close the window
french: Fermer la fenêtre

# Info1
source: The Regex rules are stored on 4DBB Forums using a web service. The authentification is secured. You can consult the regex rules published, here :
french: Les règles de Regex sont transférées sur le forum 4DBB en utilisant un service web. L'autentification est sécurisée. Les règles de Regex sont publiées sur le forum :

# Login1
source: Connection
french: Connexion

# Login2
source: I already have an account:
french: Je possède déjà un compte d'accès :

# Login3
source: Login or E-mail (*)
french: Identifiant ou adresse e-mail (*)

# Login4
source: Password
french: Mot de passe

# Login5
source: (*) E-mail address used for your 4DBB Account
french: (*) Adresse e-mail associée à votre compte 4DBB

# Login6
source: Display the password
french: Afficher le mot de passe

# Login7
source: Connect
french: Se connecter

# Login8
source: Registration
french: Enregistrement

# Login9
source: I do not have an account yet:
french: Je ne possède pas encore de compte d'accès :

# Login10
source: Register
french: S'enregistrer

# InfoGet
source: You can get all the regex rules provided by different members and stored on 4DBB Forum's server. You can consult the regex rules published, here :
french: Nous vous proposons de pouvoir récupérer des règles Regex mise à disposition par différents contributeurs et centraliées sur le serveur des forums 4DBB. Les règles de Regex sont publiées sur le forum :

# New_regex
source: New regex imported :
french: Nouveaux regex importés :

# Update_regex
source: Regex updated locally :
french: Regex modifié(s) localement :

# Error_Match_Param_0
source: 4 parameters are missing. See the Regex_Match Documentation...
french: Il manque 4 paramètres. Voir la documentation de la fonction Regex_Match...

# Error_Match_Param_1
source: 3 parameters are missing. See the Regex_Match Documentation...
french: Il manque 3 paramètres. Voir la documentation de la fonction Regex_Match...

# Error_Match_Param_2
source: 2 parameters are missing. See the Regex_Match Documentation...
french: Il manque 2 paramètres. Voir la documentation de la fonction Regex_Match...

# Error_Match_Param_3
source: 1 parameter is missing. See the Regex_Match Documentation...
french: Il manque 1 paramètre. Voir la documentation de la fonction Regex_Match...

# Error_Split_Param_0
source: 4 parameters are missing. See the Regex_Split Documentation...
french: Il manque 4 paramètres. Voir la documentation de la fonction Regex_Split...

# Error_Split_Param_1
source: 3 parameters are missing. See the Regex_Split Documentation...
french: Il manque 3 paramètres. Voir la documentation de la fonction Regex_Split...

# Error_Split_Param_2
source: 2 parameters are missing. See the Regex_Split Documentation...
french: Il manque 2 paramètres. Voir la documentation de la fonction Regex_Split...

# Error_Split_Param_3
source: 1 parameter is missing. See the Regex_Split Documentation...
french: Il manque 1 paramètre. Voir la documentation de la fonction Regex_Split...

# Error_Extract_Param_0
source: 6 parameters are missing. See the Regex_Extract Documentation...
french: Il manque 6 paramètres. Voir la documentation de la fonction Regex_Extract...

# Error_Extract_Param_1
source: 5 parameters are missing. See the Regex_Extract Documentation...
french: Il manque 5 paramètres. Voir la documentation de la fonction Regex_Extract...

# Error_Extract_Param_2
source: 4 parameters are missing. See the Regex_Extract Documentation...
french: Il manque 4 paramètres. Voir la documentation de la fonction Regex_Extract...

# Error_Extract_Param_3
source: 3 parameters are missing. See the Regex_Extract Documentation...
french: Il manque 3 paramètres. Voir la documentation de la fonction Regex_Extract...

# Error_Extract_Param_4
source: 2 parameters are missing. See the Regex_Extract Documentation...
french: Il manque 2 paramètres. Voir la documentation de la fonction Regex_Extract...

# Error_Extract_Param_5
source: 1 parameter is missing. See the Regex_Extract Documentation...
french: Il manque 1 paramètre. Voir la documentation de la fonction Regex_Extract...

# Error_Subst_Param_0
source: 6 parameters are missing. See the Regex_Substitution Documentation...
french: Il manque 6 paramètres. Voir la documentation de la fonction Regex_Substitution...

# Error_Subst_Param_1
source: 5 parameters are missing. See the Regex_Substitution Documentation...
french: Il manque 5 paramètres. Voir la documentation de la fonction Regex_Substitution...

# Error_Subst_Param_2
source: 4 parameters are missing. See the Regex_Substitution Documentation...
french: Il manque 4 paramètres. Voir la documentation de la fonction Regex_Substitution...

# Error_Subst_Param_3
source: 3 parameters are missing. See the Regex_Substitution Documentation...
french: Il manque 3 paramètres. Voir la documentation de la fonction Regex_Substitution...

# Error_Subst_Param_4
source: 2 parameters are missing. See the Regex_Substitution Documentation...
french: Il manque 2 paramètres. Voir la documentation de la fonction Regex_Substitution...

# Error_Subst_Param_5
source: 1 parameter is missing. See the Regex_Substitution Documentation...
french: Il manque 1 paramètre. Voir la documentation de la fonction Regex_Substitution...

# Error_Param_0
source: Parameters are missing
french: Les paramètres sont manquants
